app/controllers/notes_controller.rb

SELECT `notes`.* FROM `notes` WHERE `notes`.`user_id` = 1
---
	def index
		#@notes = Note.all.order("created_at DESC")
		#we want to change the index, since it display all the notes
		#we want only current user post only
		@notes= Note.where(user_id: current_user)

INSERT INTO `notes` (`title`, `content`, `created_at`, `updated_at`, `user_id`) VALUES ('note with user', 'sdf', '2016-11-03 07:02:53', '2016-11-03 07:02:53', 1)
---
	def create
		@note = current_user.notes.build(note_params)
		if @note.save

DELETE FROM `notes` WHERE `notes`.`id` = 2
---
	def destroy
		@note.destroy

SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 2 LIMIT 1
---
		def find_note
			@note = Note.find(params[:id])